str('Shrek')     #1) Создать 2 переменных типа String с разными значениями
str('Osel')      #1) Создать 2 переменных типа String с разными значениями

a = int(10)      #2) Создать 4 переменных типа Integer с разными значениями
b = int(15)      #2) Создать 4 переменных типа Integer с разными значениями
c = int(20)      #2) Создать 4 переменных типа Integer с разными значениями
d = int(25)      #2) Создать 4 переменных типа Integer с разными значениями

x = float(0.5)   #3) Создать 3 переменных типа Float с разными значениями
y = float(1.5)   #3) Создать 3 переменных типа Float с разными значениями
z = float(2.5)   #3) Создать 3 переменных типа Float с разными значениями

#4) Реализовать 15 варианта сравнения int переменных с операторами >, <, >=, <=, !=.
# Pезультаты весвести в консоль.

print(a < b)     #1
print(a < c)     #2
print(a < d)     #3
print(b > a)     #4
print(b < c)     #5
print(b < d)     #6
print(d > a)     #7
print(d > b)     #8
print(d > c)     #9
print(c > a)     #10
print(c > b)     #11
print(c < d)     #12
print(a != d)    #13
print(d >= a)    #14
print(b != d)    #15

#5) Реализовать 9 варианта сравнения Float переменных с операторами >, <, >=, <=, !=. Pезультаты весвести в консоль.

print(x < y)     #1
print(x < z)     #2
print(y > x)     #3
print(y < z)     #4
print(z > x)     #5
print(z > y)     #6
print(x != y)    #7
print(y != z)    #8
print(z >= x)    #9

#6) Реализовать 10 варианта сравнения int переменных с операторами >, <, >=, <=, != и условными выражениями (and, or, not). Pезультаты весвести в консоль.

result1 = a < b and a < c
print(result1)
result2 = a < c or d < b
print(result2)
result3 = d > c or c > b
print(result3)
result4 = not a > b
print(result4)
result5 = not d < b
print(result5)
result6 = b < d and d > c
print(result6)
result7 = a < d and b > a
print(result7)
result8 = d == b or d > c
print(result8)
result9 = not a == b
print(result9)
result10 = not a == c
print(result10)


#





